In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
filename = "titanic.csv"

In [3]:
df = pd.read_csv(filename)

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df[df['Embarked'] == 'C'].groupby('Sex')['Age'].mean()

Sex
female    28.344262
male      32.998841
Name: Age, dtype: float64

In [6]:
df[df['Embarked'] == 'C']['Age'].mean()

30.81476923076923

In [8]:
df[df['Embarked'] == 'C'].groupby('Sex')['Age'].value_counts()

Sex     Age
female  24.00    5
        17.00    3
        18.00    3
        30.00    3
        0.75     2
                ..
male    48.00    1
        50.00    1
        51.00    1
        60.00    1
        65.00    1
Name: Age, Length: 80, dtype: int64

In [14]:
em_c = df[df['Embarked'] == 'C']
em_c_f = em_c[em_c['Sex'] == 'female']
em_c_m = em_c[em_c['Sex'] == 'male']

In [27]:
em_c_f['Age'].count()

61

In [31]:
em_c_m['Age'].count()

69

In [35]:
em_c_f['Age'].sum()/em_c_f['Age'].count()

28.34426229508197

In [38]:
em_c['Age'].sum()/(em_c_f['Age'].count() + em_c_m['Age'].count())

30.81476923076923

In [39]:
# Can't add and divide by 2 to get total average because num of non-null Age data-points are different between
# the male and female population. Need to divide sum of all of those embarked by C by the sum of non-null data-points
# from the male and female population